Repository: jaywink/cartridge
Catalog: cartridge/shop/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Product filters
fi: Tuotefiltterit

source: Current variations
fi: Nykyiset muunnelmat

source: Other products
fi: Muut tuotteet

source: Create new variations
fi: Luo uusi muunnelma

source: Items
fi: Tuotteet

source: Billing details
fi: Laskutustiedot

source: Shipping details
fi: Toimitustiedot

source: Apply to product and/or products in categories
fi: Sovella tuotteeseen ja/tai tuotteisiin kategorioissa

source: Reduce unit price by
fi: Vähennä yksikön hintaa määrällä

source: Sale period
fi: Alennusmyynnin ajanjakso

source: Valid for
fi: Voimassa

source: Flat rate shipping
fi: Toimitus kiinteään hintaan

source: Tax
fi: Vero

source: Details
fi: Yksityiskohdat

source: Address
fi: Osoite

source: Payment
fi: Maksu

source: Confirmation
fi: Vahvistus

source: Controls the ordering and grouping of the admin menu.
fi: Säätää admin-valikon järjestystä ja ryhmitystä.

source: Content
fi: Sisältö

source: Media Library
fi: Mediakirjasto

source: Shop
fi: Kauppa

source: Site
fi: Sivusto

source: Users
fi: Käyttäjät

source: Sequence of models that will be provided by default as choices in the search form. Each model should be in the format ``app_label.model_name``. Only models that subclass ``mezzanine.core.models.Displayable`` should be used.
fi: Sarja malleja, joita käytetään oletusvaihtoehtoina hakulomakkeessa. Joka mallin pitää olla muotoa ``app_label.model_name`. Vain mallit, jotka perivät luokasta ``mezzanine.core.models.Displayable`` kelpaavat.

source: Sequence of setting names available within templates.
fi: Sarja sivupohjissa näkyviä asetusten nimiä.

source: Enable featured images in shop categories
fi: Salli korostettu kuva kaupan kategorioissa

source: Checkout account required
fi: Tunnus vaaditaan ostamiseen

source: If True, users must create a login for the checkout process.
fi: Jos True, käyttäjän pitää luoda tunnus ostaakseen.

source: Payment Enabled
fi: Maksaminen sallittu

source: If False, there is no payment step on the checkout process.
fi: Jos False, ostoprosessissa ei ole maksuvaihetta.

source: Currency Locale
fi: Valuutan maa-asetus

source: Default Shipping Cost
fi: Oletustoimituskulu

source: Default cost of shipping when no custom shipping is implemented.
fi: Toimituskulujen oletushinta kun omaa lähettämistä ei ole toteutettu.

source: Discount in Cart
fi: Ostoskorin alennus

source: Discount codes can be entered on the cart page.
fi: Alennuskoodeja voi syöttää ostoskorin sivulla.

source: Discount in Checkout
fi: Ostotapahtuman alennus

source: Discount codes can be entered on the first checkout step.
fi: Alennuskoodeja voi syöttää ostamisen ensimmäisessä vaiheessa.

source: Billing & Shipping Handler
fi: Laskutuksen ja toimituksen käsittelijä

source: Order Handler
fi: Tilauksen käsittelijä

source: Payment Handler
fi: Maksun käsittelijä

source: Size
fi: Koko

source: Colour
fi: Väri

source: Order Email Subject
fi: Tilaussähköpostin otsikko

source: Subject to be used when sending the order receipt email.
fi: Otsikko, jota käytetään tilauskuitin sähköpostissa.

source: Order Receipt
fi: Tilauksen kuitti

source: From Email
fi: Lähettäjän sähköpostiosoite

source: Email address from which order receipts should be emailed.
fi: Osoite, josta tilausten kuitit lähetetään.

source: BCC receipts to
fi: Lähetä piilokopio kuiteista osoitteeseen

source: All order receipts will be BCCd to this address.
fi: Kaikista tilauskuiteista lähetetään BCC osoitteeseen

source: Unprocessed
fi: Käsittelemätön

source: Processed
fi: Käsitelty

source: Products Per Category Page
fi: Tuotteden lukumäärä kategoriasivulla

source: Number of products to display per category page.
fi: Montako tuotetta näytetään jokaisella kategoriasivulla

source: Recently added
fi: Viimeksi lisätty

source: Highest rated
fi: Korkeimmaksi arvosteltu

source: Least expensive
fi: Edullisin

source: Most expensive
fi: Kallein

source: Use product variations
fi: Käytä tuotevariaatioita

source: Use product ratings
fi: Käytä tuotearvosteluja

source: Use product wishlist
fi: Käytä tuotteiden toivomuslistaa

source: SKU
fi: Varastokoodi

source: The selected options are currently unavailable.
fi: Tekemäsi valinnat eivät ole tällä hetkellä saatavilla.

source: The selected options are currently not in stock.
fi: Tekemäsi valinnat eivät ole tällä hetkellä varastossa.

source: The selected quantity is currently unavailable.
fi: Valittua määrää ei juuri nyt ole varastossa.

source: The whole period is not available.
fi: Koko aikajakso ei ole varattavissa.

source: Cannot edit quantity of reservable product.
fi: Valittua määrää ei ole tällä hetkellä saatavilla.Varattavan tuotteen määrää ostoskorissa ei voi muokata. Poista varaus kokonaisena.

source: Quantity
fi: Määrä

source: The discount code entered is invalid.
fi: Annettu alennuskoodi ei kelpaa.

source: Free shipping
fi: Maksuton toimitus

source: My delivery details are the same as my billing details
fi: Toimitustietoni ovat samat kuin laskutustietoni

source: Remember my address for next time
fi: Muista osoitteeni ensi kerralla

source: Cardholder name
fi: Kortin omistajan nimi

source: Card type
fi: Kortin tyyppi

source: Card number
fi: Kortin numero

source: Card expiry month
fi: Kortin umpeutumiskuukausi

source: Card expiry year
fi: Kortin umpeutumisvuosi

source: A security code, usually the last 3 digits found on the back of your card.
fi: Turvakoodi, yleensä 3 viimeistä numeroa korttisi takapuolella.

source: A valid expiry date is required.
fi: Oikea umpeutumispäivämäärä tarvitaan.

source: This field is required.
fi: Tämä on vaadittu kenttä.

source: Please fill out all fields.
fi: Täytäthän kaikki kentät.

source: Only one variation can be checked as the default.
fi: Vain yksi variaatio voi olla valittu kerrallaan.

source: Please enter a value for only one type of reduction.
fi: Anna vain yhden alennuksen arvo.

source: Unit price
fi: Kappalehinta

source: Sale price
fi: Alennettu hinta

source: Sale start
fi: Alennusmyynti alkaa

source: Sale end
fi: Alennusmyynti päättyy

source: Number in stock
fi: Varaston lukumäärä

source: Name
fi: Nimi

source: Price change
fi: Hinnan muutos

source: Available for purchase
fi: Ostettavissa

source: Image
fi: Kuva

source: Product categories
fi: Tuotekategoriat

source: Date added
fi: Lisäyspäivämäärä

source: Related products
fi: Liittyvät tuotteet

source: Upsell products
fi: Mainostetut tuotteet

source: Product
fi: Tuote

source: Products
fi: Tuotteet

source: Reservable Product
fi: Varattava tuote

source: Reservable Products
fi: Varattavat tuotteet

source: From date
fi: Tulopäivä

source: To date
fi: Lähtöpäivä

source: Date
fi: Päivämäärä

source: Last updated
fi: Viimeksi päivitetty

source: Description
fi: Kuvaus

source: Images
fi: Kuvat

source: Type
fi: Tyyppi

source: Product option
fi: Tuotevaihtoehto

source: Product options
fi: Tuotevaihtoehdot

source: Default
fi: Oletus

source: Featured Image
fi: Ajankohtainen kuva

source: Sale
fi: Alennusmyynti

source: Minimum price
fi: Vähimmäishinta

source: Maximum price
fi: Enimmäishinta

source: Combined
fi: Yhdistetty

source: If checked, products must match all specified filters, otherwise products can match any specified filter.
fi: Jos valittu, tuotteiden on täsmättävä valittuihin suodattimiin, tai muuten tuotteet voivat täsmätä mihin vain valittuun suodattimeen.

source: Product category
fi: Tuotekategoria

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: Street
fi: Katu

source: City/Suburb
fi: Kaupunki

source: State/Region
fi: Maakunta

source: Zip/Postcode
fi: Postinumero

source: Country
fi: Maa

source: Phone
fi: Puhelinnumero

source: Email
fi: Sähköpostiosoite

source: Additional instructions
fi: Lisäohjeistukset

source: Time
fi: Aika

source: Shipping type
fi: Toimituksen tyyppi

source: Shipping total
fi: Toimitus yhteensä

source: Tax type
fi: Veron tyyppi

source: Tax total
fi: Vero yhteensä

source: Item total
fi: Tuotteita yhteensä

source: Discount code
fi: Alennuskoodi

source: Discount total
fi: Alennus yhteensä

source: Order total
fi: Tilaus yhteensä

source: Transaction ID
fi: Tapahtuman tunniste

source: Status
fi: Tila

source: Order
fi: Tilaus

source: Orders
fi: Tilaukset

source: Download PDF invoice
fi: Lataa PDF-lähete

source: Weekend
fi: Viikonloppu

source: Total price
fi: Hinta yhteensä

source: Title
fi: Otsikko

source: Active
fi: Aktiivinen

source: Categories
fi: Kategoriat

source: Reduce by amount
fi: Vähennä määrällä

source: Reduce by percent
fi: Vähennä prosenteilla

source: Reduce to amount
fi: Vähennä määrään

source: Valid from
fi: Voimassa alkaen

source: Valid to
fi: Voimassa päättyen

source: Sales
fi: Alennusmyynnit

source: Code
fi: Koodi

source: Minimum total purchase
fi: Ostosten vähimmäishinta

source: Uses remaining
fi: Käyttökertoja jäljellä

source: If you wish to limit the number of times a code may be used, set this value. It will be decremented upon each use.
fi: Jos haluat rajoittaa montako kertaa alennuskoodia voi käyttää, aseta tämä arvo. Sitä vähennetään joka käyttökerralla.

source: Discount codes
fi: Alennuskoodit

source: Invalid currency locale specified for SHOP_CURRENCY_LOCALE: '%s'. You'll need to set the locale for your system, or configure the SHOP_CURRENCY_LOCALE setting in your settings module.
fi: Epäkelpo maa-asetus annettu asetukselle SHOP_CURRENCY_LOCALE: '%s'. Sinun täytyy asettaa järjestelmäsi maa-asetukset tai määrittää SHOP_CURRENCY_LOCALE -asetus settings-moduulissasi.

source: Item added to cart
fi: Tuote lisätty ostoskoriin

source: Item added to wishlist
fi: Tuote lisätty toivomuslistalle

source: Item removed from wishlist
fi: Tuote poistettu toivomuslistalta

source: Your cart has expired
fi: Korttisi on umpeutunut

source: Cart updated
fi: Ostoskori päivitetty

source: Category
fi: Kategoria

source: Sub-Category
fi: Alakategoria

source: Number in Stock
fi: Lukumäärä varastossa

source: Unit Price
fi: Kappalehinta

source: Sale Price
fi: Alennettu hinta

source: Sale Start Date
fi: Alennusmyynnin alkamispäivämäärä

source: Sale Start Time
fi: Alennusmyynnin alkamiskellonaika

source: Sale End Date
fi: Alennusmyynnin päättymispäivämäärä

source: Sale End Time
fi: Alennusmyynnin päättymiskellonaika

source: product
fi: tuote

source: Import/Export products from a csv file.
fi: Tuo/Vie tuotteita CSV-tiedostosta.

source: Import products from csv file.
fi: Tuo tuotteita CSV-tiedostosta.

source: Export products from csv file.
fi: Vie tuotteita CSV-tiedostoon.

source: Please provide csv file to import
fi: Anna CSV-tiedosto, josta tuoda

source: need to import or export
fi: täytyy joko tuoda tai viedä

source: Importing ..
fi: Tuodaan ..

source: Exporting ..
fi: Viedään ..

source: A general error occured:
fi: Yleinen virhe tapahtui:

source: Transaction declined:
fi: Tapahtuma evätty:

source: Transaction declined
fi: Tapahtuma evätty

source: View past orders
fi: Katso aiemmat tilaukset

source: Re-send order email
fi: Lähetä tilausvahvistus sähköposti uudestaan

source: History
fi: Historia

source: Add
fi: Lisää

source: Dear
fi: Arvoisa

source: Your order has been successful, details are below.
fi: Tilauksesi onnistui, alla ovat yksityiskohdat.

source: Order ID:
fi: Tilauksen tunniste:

source: Billing Details:
fi: Laskutuksen tiedot:

source: Shipping Details:
fi: Toimituksen tiedot:

source: Items Ordered:
fi: Tilatut tuotteet:

source: each
fi: kappale

source: 1 item
fi: 1 tuote

source: in cart
fi: ostoskorissa

source: Return to Checkout
fi: Palaa kassalle

source: Go to Checkout
fi: Jatka kassalle

source: Wishlist contains 1 item
fi: Toivomuslistalla on 1 tuote

source: Sort by
fi: Järjestys

source: On sale:
fi: Alennusmyynnissä:

source: Coming soon
fi: Tulee pian

source: If you have an existing account or would like to create one, please <a href="%(login_url)s?next=%(next)s">log in</a> or <a href="%(signup_url)s?next=%(next)s">sign up</a>.
fi: Jos sinulla on tunnus tai haluat rekisteröityä, ystävällisesti <a href="%(login_url)s?next=%(next)s">kirjaudu sisään</a> tai <a href="%(signup_url)s?next=%(next)s">rekisteröidy</a>.

source: Billing Details
fi: Laskutustiedot

source: Delivery Details
fi: Toimitustiedot

source: Your Cart
fi: Ostoskorisi

source: Item
fi: Tuote

source: Qty
fi: Määrä

source: Price
fi: Hinta

source: Remove?
fi: Poista?

source: Specials
fi: Erikoishinnat

source: Modification
fi: Muutos

source: Update Cart
fi: Päivitä ostoskori

source: Apply
fi: Käytä

source: You may also like:
fi: Saatat myös pitää näistä:

source: Your Cart is empty.
fi: Ostoskorisi on tyhjä.

source: Checkout
fi: Kassa

source: Step
fi: Vaihe

source: Complete
fi: Valmis

source: Next
fi: Seuraava

source: Back
fi: Edellinen

source: Your cart is empty.
fi: Ostoskorisi on tyhjä.

source: This may be due to your session timing out after a period of inactivity.
fi: Tämä voi johtua aikakatkaisusta pitkän paikallaolon jälkeen.

source: We apologize for the inconvenience.
fi: Pahoittelemme vaivasta.

source: Continue Shopping
fi: Jatka ostoksia

source: Edit Cart
fi: Muokkaa ostoskoria

source: Order Complete
fi: Tilaus on valmis

source: Thank you for shopping with us, your order is complete.
fi: Kiitos kun ostitte meiltä, tilauksesi on valmis.

source: We've sent you a receipt via email.
fi: Lähetimme sinulle kuitin sähköpostissa.

source: You can also view your invoice using one of the links below.
fi: Voit myös tarkistaa lähetteen allaolevista linkeistä.

source: View invoice in your browser
fi: Katso lähete selaimessa

source: Shipping Details
fi: Toimitustiedot

source: Order History
fi: Tilaushistoria

source: Date / time
fi: Päivämäärä / kellonaika

source: Paid
fi: Maksettu

source: Download PDF
fi: Lataa PDF

source: View invoice
fi: Katso lähete

source: You have not ordered anything from us yet.
fi: Et ole tilannut meiltä mitään vielä.

source: Buy
fi: Osta

source: Save for later
fi: Tallenna myöhempää ajankohtaa varten

source: This product is currently unavailable.
fi: Tämä tuote ei ole tällä hetkellä saatavilla

source: Related Products
fi: Liittyvät tuotteet

source: Your Wishlist
fi: Toivomuslistasi

source: Remove
fi: Poista

source: Your wishlist is empty.
fi: Toivomuslistasi on tyhjä.

source: Your Details
fi: Tietosi

source: Items Ordered
fi: Tilatut tuotteet

source: Sub total
fi: Välisumma

source: Discount
fi: Alennus

source: Shipping
fi: Toimitus

source: Total
fi: Yhteensä

source: Payment Details
fi: Maksutiedot

source: Card Expiry
fi: Kortin umpeutuminen

source: Price per night
fi: Hinta per yö

source: Normal price
fi: Normaali hinta

source: Weekend (Fri-Sat or Sat-Sun) price
fi: Viikonloppu (Pe-La tai La-Su) hinta

source: period between
fi: aika välillä

source: weekend nights
fi: viikonloppuyöt

source: Reserve
fi: Tee varaus
